# Adding & Removing Rows and Columns in Pandas

In [2]:
import pandas as pd

In [3]:
# Sample Titanic-like data
data = {
    "Name": ["Jack", "Rose", "Tom", "Ananda"],
    "Age": [22, 19, 25, 20],
    "Sex": ["male", "female", "male", "male"],
    "Survived": [1, 1, 0, 1],
    "Fare": [50, 100, 30, 60]
}

df = pd.DataFrame(data)
df

     Name  Age     Sex  Survived  Fare
0    Jack   22    male         1    50
1    Rose   19  female         1   100
2     Tom   25    male         0    30
3  Ananda   20    male         1    60

In [4]:
# Add a new column with default value
# Using .loc to add column
df.loc[:, "Embarked"] = "C"
df

     Name  Age     Sex  Survived  Fare Embarked
0    Jack   22    male         1    50        C
1    Rose   19  female         1   100        C
2     Tom   25    male         0    30        C
3  Ananda   20    male         1    60        C

In [ ]:
# Add a column based on calculation
df.loc[:, "Fare_after_tax"] = df["Fare"] * 1.10
df

In [ ]:
# add another columns

In [ ]:
# Keep only selected columns using .loc
df = df.loc[:, ["Name", "Age", "Sex", "Survived", "Fare"]]
df

     Name  Age     Sex  Survived  Fare
0    Jack   22    male         1    50
1    Rose   19  female         1   100
2     Tom   25    male         0    30
3  Ananda   20    male         1    60

In [7]:
df

     Name  Age     Sex  Survived  Fare
0    Jack   22    male         1    50
1    Rose   19  female         1   100
2     Tom   25    male         0    30
3  Ananda   20    male         1    60

In [8]:
df.loc[5] = {"Name": "Leo", "Age": 30, "Sex": "male"}
# add new rows using the dictionary

     Name  Age     Sex  Survived   Fare Embarked
0    Jack   22    male       1.0   50.0        C
1    Rose   19  female       1.0  100.0        C
2     Tom   25    male       0.0   30.0        C
3  Ananda   20    male       1.0   60.0        C
5     Leo   30    male       NaN    NaN      NaN

for dictionary
Pandas will automatically fill missing columns with NaN.

In [ ]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Clara'],
    'Age': [25, 30, 28],
    'Sex': ['female', 'male', 'female']
})

# Change Bob's Age and Sex
df.loc[df['Name'] == 'Bob', ['Age', 'Sex']] = [31, 'male']

print(df)

In [ ]:
# Changes multiple columns
df.loc[df['Name'] == 'Clara', ['Age', 'Sex', 'Status']] = [29, 'female', 'Married']

print(df)

In [9]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Clara'],
    'Age': [25, 30, 28]
})

# Add a new column 'Sex'
df.loc[:, 'Sex'] = ['female', 'male', 'female']

print(df)

    Name  Age     Sex
0  Alice   25  female
1    Bob   30    male
2  Clara   28  female

In [ ]:
df.loc[3]

### Examples of when you need `inplace=True` (including index operations)

| Operation | Default behavior | With `inplace=True` |
|-----------|----------------|------------------|
| `df.drop("x", axis=1)` | Returns a new DataFrame without column `"x"`; original `df` stays the same | Original `df` loses column `"x"` |
| `df.drop(0, axis=0)` | Returns a new DataFrame without row 0; original `df` unchanged | Original `df` loses row 0 |
| `df.sort_values("col")` | Returns a sorted copy; original `df` unchanged | Original `df` is sorted |
| `df.sort_index()` | Returns a copy sorted by index; original `df` unchanged | Original `df` is sorted by index |
| `df.fillna(0)` | Returns a copy with NaNs replaced | Original `df` modified |
| `df.rename(columns={"old":"new"})` | Returns a copy with renamed columns | Original `df` modified |
| `df.rename(index={0:"zero"})` | Returns a copy with renamed index | Original `df` index modified |
| `df.set_index("col")` | Returns a new DataFrame with `"col"` as index; original df unchanged | Original `df` now uses `"col"` as index |
| `df.reset_index()` | Returns a copy with index reset; original df unchanged | Original `df` index reset |